[
    {
      "year": 2015,
      "event": "Elewa is born",
      "description": "From a Belgian garage and Embakasi apartment, Elewa first sees the light as a purely SaaS-based EdTech analyzing KCSE past papers."
    },
    {
      "year": 2017,
      "event": "Kickstarting Elewa Education",
      "description": "With an initial pre-seed investment of friends and family and a masters thesis on the subject, Elewa pilots it's innovative \"Four Pillars\" model in 5 secondary schools across Kenya. Learning outcomes go through the roof in only one term."
    },
    {
      "year": 2018,
      "event": "Commercial exploration",
      "description": "Successfully piloting in 5 schools, Elewa Education is ready for the market. Elewa founds Elewa Investment, a cooperative fund in Belgium aimed at fueling the growth of Elewa. Elewa launching four commercial services across schools in Kenya."
    },
    {
      "year": 2019,
      "event": "Elewa on the map",
      "description": "Elewa is recognized by UNESCO as Kenyan representative and top 10 innovations in the UNESCO ICT in Education Prize (Theme AI & education). Elewa joins the fourth Cohort of the \"Google for Startups Africa\" accelerator program."
    },
    {
      "year": 2020,
      "event": "Elewa Diversifies",
      "description": "Elewa takes a step into the future with Jente Rosseel as CEO, Kennedy Adhola as HR Director and Peter Reinartz as chairman. Elewa Education generalizes its innovative model and finds product market-fit in the professional training space across Education, Health and Agriculture & Environment. iTalanta is born. A tech offshoring company which provides software development services to clients in Europe and the US."
    },
    {
      "year": 2021,
      "event": "Conversational Learning",
      "description": "Elewa Education launches first Conversational learning pilot together with the Kenya Scouts Association. iTalanta grows to be a major activity within the company."
    },
    {
      "year": 2023,
      "event": "Elewa Group",
      "description": "Elewa establishes itself as a regional player in Professional Education and Technology development. Consolidates its activities through Elewa NV/Group. First investment in a Venture Lab by Elewa Group."
    }
  ]